lendanote_app_api/app/controllers/users_controller.rb

    def create
      @user = User.new(user_params)

      if @user.save
---
INSERT INTO "users" ("name", "school", "region", "email", "phone", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def login
      user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jane.teacher@school.edu"], ["LIMIT", 1]]